#+title: PMI
#+author: Jonatan Pilak

* DONE PoC - SFTP: kick-off                                             :mtg:
   SCHEDULED: <2024-06-13 Thu>
:LOGBOOK:
CLOCK: [2024-06-13 Thu 15:00]--[2024-06-13 Thu 15:30] => 0:30
:END:
* DONE [TGK SFTP POC] org                                               :mtg:
   SCHEDULED: <2024-06-14 Fri>
:LOGBOOK:
CLOCK: [2024-06-14 Fri 11:15]--[2024-06-14 Fri 12:15] => 1:00
:END:
* TODO Setting up pmi ms account                                       :task:
   :LOGBOOK:
   CLOCK: [2024-06-17 Mon 14:53]--[2024-06-17 Mon 16:29] =>  1:36
   CLOCK: [2024-06-13 Thu 18:00]--[2024-06-13 Thu 18:41] => 0:41
   CLOCK: [2024-06-14 Fri 09:00]--[2024-06-14 Fri 09:45] => 0:45
   CLOCK: [2024-06-14 Fri 15:00]--[2024-06-14 Fri 16:45] => 1:45
   :END:
   - [x] Login
   - [x] set MFA
   - [x] check if all works: jira,bb,conflu,deep,aws,tf
   - [-] fight with not working teams
   - [x] setup aws

* DONE [TGK SFTP POC] catch-up                                          :mtg:
SCHEDULED: <2024-06-17 Mon>
:LOGBOOK:
CLOCK: [2024-06-17 Mon 15:00]--[2024-06-17 Mon 15:17] =>  0:05
:END:

* DONE Recreate AWS resources manually                                 :task:
   :LOGBOOK:
   CLOCK: [2024-06-17 Mon 20:36]--[2024-06-17 Mon 22:00] =>  1:24
   :END:

* Reporting                                                          :report:
** Last week
#+BEGIN: clocktable :step day :tstart "<-1w>" :tend "<now>" :compact t
#+END:
** This week
#+BEGIN: clocktable :step day :block thisweek :compact t

#+END:
